In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import seaborn as sns

In [16]:
pd.DataFrame({'x': [1, 2, 3]})

   x
0  1
1  2
2  3

In [17]:
locations = pd.read_csv('location_info_table.csv')

In [18]:
locations

,location,location_name,street_address,city,state,zipcode,location_id
0,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123,1
1,N,Noodles & Company,3805 Forbes Ave,Pittsburgh,PA,15123,2
2,P,Panera Bread,3800 Forbes Ave,Pittsburgh,PA,15123,3

How would I select `location_id` and `location` from `locations` DataFrame?

In [19]:
locations.loc[:, ['location_id', 'location']]

   location_id location
0            1        D
1            2        N
2            3        P

In [20]:
locations[['location_id', 'location']]

   location_id location
0            1        D
1            2        N
2            3        P

How can I select the rows associated with Dunkin Donuts?

In [21]:
locations.loc[ locations.location == 'D' ]

,location,location_name,street_address,city,state,zipcode,location_id
0,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123,1

In [22]:
locations.loc[ locations.location_name == 'Dunkin Donuts']

,location,location_name,street_address,city,state,zipcode,location_id
0,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123,1

In [23]:
locations.loc[ locations.location.isin(['D']) ]

,location,location_name,street_address,city,state,zipcode,location_id
0,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123,1

Find all rows associated with dunkin donuts or panera.

In [34]:
locations.loc[ (locations.location == 'D') | (locations.location == 'P') ]

,location,location_name,street_address,city,state,zipcode,location_id
0,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123,1
1,N,Noodles & Company,3805 Forbes Ave,Pittsburgh,PA,15123,2

In [25]:
locations.loc[ locations.location.isin(['D', 'P']) ]

,location,location_name,street_address,city,state,zipcode,location_id
0,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123,1
2,P,Panera Bread,3800 Forbes Ave,Pittsburgh,PA,15123,3

In [26]:
shoes = pd.read_csv('shoe_info_table.csv')

In [27]:
shoes

  shoe shoe_color  shoe_id
0    B      Black        1
1    O      Other        2
2    R        Red        3
3    W      White        4

In [28]:
shoes_per_day = pd.read_csv('shoes_per_day_table.csv')

In [35]:
shoes_per_day
shoes_per_day.loc[ (shoes_per_day.location_id == 2) & (shoes_per_day.value > 10)]

    id  day  location_id  shoe_id  value
0    1    1            2        4     12
6    7    3            2        1     22
12  13    1            2        2     15
13  14    2            2        2     20
14  15    3            2        2     13